cask_args appdir: "/Applications"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/homebrew-cask-fonts"
tap "homebrew/cask-drivers"
tap "homebrew/services"

# Command line apps to install via Homebrew
brew "exa"
brew "fd"
brew "fzf"
brew "git"
brew "htop"
brew "mas"
brew "node"
brew "openssl"
brew "tldr"
brew "z"

# Desktop apps to install via Cask
cask "1password"
cask "1password-cli"
cask "cloudmounter"
cask "chromium"
cask "coconutbattery"
cask "citrix-receiver"
cask "dropbox"
cask "firefox"
cask "microsoft-office"
cask "google-chrome"
cask "sketch"
cask "skype"
cask "slack"
cask "tableplus"
cask "vlc"
cask "zeplin"

# Stuff from MacAppstore
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "iMovie", id: 408981434